export const digitsToRuMonthsObject = {
    '01': 'янв',
    '02': 'фев',
    '03': 'мар',
    '04': 'апр',
    '05': 'мая',
    '06': 'июн',
    '07': 'июл',
    '08': 'авг',
    '09': 'сент',
    '10': 'окт',
    '11': 'нояб',
    '12': 'дек',
};

export const enMonthsToDigitsObject = {
    'Jan' : '01',
    'Feb' : '02',
    'Mar' : '03',
    'Apr' : '04',
    'May' : '05',
    'Jun' : '06',
    'Jul' : '07',
    'Aug' : '08',
    'Sep' : '09',
    'Oct' : '10',
    'Nov' : '11',
    'Dec' : '12',
}

export const asteroidDescriptionTitlesArray = [
    'Обозначение',
    'Диаметр (в футах)',
    'Диаметр (в метрах)',
    'Диаметр (в километрах)',
    'Диаметр (в милях)',
    'Диаметр (в милях)',
    'Представляет опасность',
    'Эксцентриситет',
    'Афелий (в млн. км)',
    'Перигелий (в млн. км)',
    'Аргумент перигелия (в градусах)',
    'Период обращения (в днях)',
    'Наклонение (в градусах)',
    'Долгота восходящего узла (в градусах)',
    'Средняя аномалия (в градусах)',
    'Абсолютная звездная величина'
]

export const planetNamesRUMap = new Map([
    ['Merc', 'Меркурий'],
    ['Venus', 'Венера'],
    ['Earth', 'Земля'],
    ['Mars', 'Марс'],
    ['Juptr', 'Юпитер'],
    ['Saturn', 'Сатурн'],
    ['Uranus', 'Уран'],
    ['Neptune', 'Нептун'],
])
